<?php 
echo "Найтие все числа кратные и 3 и 5  в диапазоне от 1000 до 2000<br><br>";
$sum1 = 0;
$sum2 = 0;
for ($i=2000; $i >= 1000; $i = $i -1) { 
	if ($i % 3 == 0) {
		echo $i . " кратное трем<br>";
		$sum1 = $sum1 + 1;
	} 
	if ($i % 5 == 0) {
		echo $i . " кратное пяти<br>";
		$sum2 = $sum2 + 1;
	} 
}
echo "<br> <strong>Общее количество чисел кратных трем равно</strong> " . $sum1 . "<br>";
echo "<br> <strong>Общее количество чисел кратных пяти равно</strong> " . $sum2 . "<br>";