<?php
//Вывести на экран сумму всех нечетных чисел в диапазоне от случайного числа $a (1, 80) до случайного числа $b (40, 150)

echo "Вывести на экран сумму всех нечетных чисел в диапазоне от случайного числа $a (1, 80) до случайного числа $b (40, 150) <br>";

$a = rand(1, 80);
$b = rand(40, 150);
$c = $b;

echo $a . " - A<br>";
echo $b . " - B<br>";

if ($a > $b) {
	$b = $a;
	$a = $c;
}

echo " ----------------------------------<br>";
echo $a . " - A<br>";
echo $b . " - B<br>";
$sum = 0;
echo "<br>";
for ($i = $a; $i <= $b ; $i++) { 
	if ($i%2 == 1) {
			echo $i . " ";
			$sum = $sum + $i;
		}

}
echo "<br><br>";

echo $sum . " Сумма всех чисел <br><br><br>";





echo $a = 60 . " - A<br>";
echo $b = 30 . " - B<br>";
echo "-------------<br>";
$a = $a - $b;//30
$b = $b + $a;//60
$a = $b - $a;//30
echo $a  . " - A<br>";
echo $b  . " - B<br>";


