<?php
//Даны два случайных трехзначных числа $a и $b. Реализуйте процесс умножения столбиком числа $a на число $b;
echo "Даны два случайных трехзначных числа $a и $b. Реализуйте процесс умножения столбиком числа $a на число $b;<br>";
$a = 486;
$b = 392;

echo $b . "<br>";
echo $a . "<br>-----<br>";
$sum=0;
$num=0;
$x = 0;

for ($i=$a; $i > 1; $i=$i/10) { 
	$k = $i%10;//
	$num = $num+1 . " Num<br>";
	echo "--------------<br>";
		if ($num == 1) {
			$sum = $k*$b;
			echo $k . " X " . $b . " = " . $sum . " <br>";
		}
		if ($num == 2) {
			$sum = $k*$b*10;
			echo $k . " X " . $b . " = " . $sum . " <br>";
		}
		if ($num == 3) {
			$sum = $k*$b*100;
			echo $k . " X " . $b . " = " . $sum . " <br>";
		}
		$x = $sum + $x;
		
}
echo "<br>" . $x . " складываем все результаты<br>";
echo "Проверка - a*b= " . $x=$a*$b;

