<?php
$t = rand(-40, 45);  
$f = rand(0, 100);  
$t_normal = 20;
$f_normal = 50;

echo "<h3>Задача 5. Климат контроль <br>Проверка параметров</h3>";
echo "Текущая температура " . $t . "<br>";
echo "Текущая влажность " . $f . "<br>";
echo "<br>";
$dt = $t_normal - $t;

echo "<strong>Разница температуры</strong> (dt = t_normal - t) " . $dt;
echo "<br>";


if ($dt <= -25) {
	echo "Кондиционер " . $cond = "максимальный";
	echo "<br>Обогреватель выкл";// для проверки
	$obogr1 = "выкл";
} 
elseif (-25 < $dt AND $dt <= -15) {
	echo "Кондиционер " . $cond = "средний";
	echo "<br>Обогреватель выкл";// для проверки
	$obogr1 = "выкл";
} 
elseif (-15 < $dt AND $dt <= -8) {
	echo "Кондиционер " . $cond = "умеренный";
	echo "<br>Обогреватель выкл";// для проверки
	$obogr1 = "выкл";
} 
elseif (-8 < $dt AND $dt < 0) {
	echo "Кондиционер " . $cond = "минимальный";
	echo "<br>Обогреватель выкл";// для проверки
	$obogr1 = "выкл";
} 
elseif (0 < $dt AND $dt <= 8) {
	echo "Кондиционер " . $cond = "выкл" ;
	echo "<br>Обогреватель минимальный";// для проверки
	$obogr1 = "минимальный";
} 
elseif (8 < $dt AND $dt <= 15) {
	echo "Кондиционер " . $cond = "выкл" ;
	echo "<br>Обогреватель умеренный";// для проверки
	$obogr1 = "умеренный";
} 
elseif (15 < $dt AND $dt <= 25) {
	echo "Кондиционер " . $cond = "выкл" ;
	echo "<br>Обогреватель средний";// для проверки
	$obogr1 = "средний";
} 
elseif ($dt > 25) {
	echo "Кондиционер " . $cond = "выкл" ;
	echo "<br>Обогреватель максимальный";// для проверки
	$obogr1 = "максимальный";
} 
echo " - (Если включен то не трогаем, если выключен подтягиваем параметры ниже)";
//********************************
echo "<br><br><br>";
$df =  $f_normal - $f;
echo "<strong>Разница влажности</strong> (df = f_normal - f) " . $df;
echo "<br>";


if ($df <= -25) {
	echo "Орошение " . $orosh = "выкл";
	echo "<br>Обогреватель средний";
	$obogr2 = "средний";
} 
elseif (-25 < $df AND $df <= -10) {
	echo "Орошение " . $orosh = "выкл";
	echo "<br>Обогреватель умеренный";
	$obogr2 = "умеренный";
} 
elseif (-10 < $df AND $df < 0) {
	echo "Орошение " . $orosh = "выкл";
	echo "<br>Обогреватель минимальный";
	$obogr2 = "минимальный";
} 
elseif (0 < $df AND $df <= 10) {
	echo "Орошение " . $orosh = "минимальный";
	echo "<br>Обогреватель выкл";
	$obogr2 = "выкл";
} 
elseif (10 < $df AND $df <= 25) {
	echo "Орошение " . $orosh = "средний";
	echo "<br>Обогреватель выкл";
	$obogr2 = "выкл";
} 
elseif ($df > 25) {
	echo "Орошение " . $orosh = "максимальный";
	echo "<br>Обогреватель выкл";
	$obogr2 = "выкл";
} 


echo "<br><br>" . "*********************************************" . "<br>";
echo "<h3>Решение</h3>";
//Кондёр
if ($cond != "выкл") {
	echo "- Вкл кондиционер на <strong>" . $cond . "</strong> уровень мощности;<br>";
} else {
	echo "<strong>- Выкл</strong> кондиционер<br>";
}

//Орошение
if ($orosh != "выкл") {
	echo "- Вкл орошение на <strong>" . $orosh . "</strong> уровень мощности;<br>";
} else {
	echo "<strong>- Выкл</strong> орошение<br>";
}
//Обогреватель
if ($obogr1 != "выкл") {
	echo "- Обогреватель <strong>" . $obogr1 . "<strong>";
}
else {
	echo "- Обогреватель <strong>" . $obogr2 . "</strong>";
}

//echo "- Выкл обогреватель<br>";